<?php
/*
 * @Descripttion: 
 * @version: 
 * @Author: sueRimn
 * @Date: 2020-03-18 14:05:27
 * @LastEditors: sueRimn
 * @LastEditTime: 2020-06-04 15:23:51
 */
/*
 * @Descripttion: 
 * @version: 
 * @Author: sueRimn
 * @Date: 2020-03-18 14:05:27
 * @LastEditors: sueRimn
 * @LastEditTime: 2020-05-26 09:59:52
 */

return [
    'legal' => '法币',
    'way' => '交易方向',
    'BUY' => '买入',
    'SELL' => '卖出',
    'alipay' => '支付宝',
    'wxpay' => '微信',
    'bank' => '银行卡',
    '用户:way交易与商家达成匹配,开始交易' => '用户:way交易与商家达成匹配,开始交易',
    '抱歉,您没有发布:coin:way的权限' => '抱歉,您没有发布:coin:way的权限',
    '您至少应选择一种支付/收款方式' => '您至少应选择一种支付/收款方式',
    '您还没有设置[:payways]支付/收款信息' => '您还没有设置[:payways]支付/收款信息',
    '抱歉,您的:balance_type余额不足! 当前余额::balance' => '抱歉,您的:balance_type余额不足! 当前余额::balance',
    '商家发布挂卖交易' => '商家发布挂卖交易',
    '请在30分钟内完成支付并在系统上传支付凭证,否则订单将自动被取消' => '请在30分钟内完成支付并在系统上传支付凭证,否则订单将自动被取消',
    '买方已支付' => '买方已支付',
    '法币交易:卖方确认交易' => '法币交易:卖方确认交易',
    '法币交易:取消交易' => '法币交易:取消交易',
    '交易确认' => '交易确认',
    'ok' => 'ok',
    '当前状态不能确认' => '当前状态不能确认',
    '当前状态不能取消' => '当前状态不能取消',
    '您不是商家或者商家身份异常' => '您不是商家或者商家身份异常',
    '请求成功' => '请求成功',
    '法币账户' => '法币账户',
    '用户匹配交易销售' => '用户匹配交易销售',
    '卖方取消场外交易' => '卖方取消场外交易',
    '您尚未设置付款/收款信息！' => '您尚未设置付款/收款信息！',
    '抱歉，您没有权限投递：投币方式！' => '抱歉，您没有权限投递：投币方式！',
    '币种信息有误' => '币种信息有误',
    '最大交易数量不能小于最小交易数量' => '最大交易数量不能小于最小交易数量',
    '您的申请还未审核,请耐心等待,不要重复提交' => '您的申请还未审核,请耐心等待,不要重复提交',
    '您已是商家,请勿重复申请' => '您已是商家,请勿重复申请',
    '您不是商家或商家状态异常,不能申请币种权限' => '您不是商家或商家状态异常,不能申请币种权限',
    '您已经拥有申请币种的权限,请不要重复申请' => '您已经拥有申请币种的权限,请不要重复申请',
    '交易不存在' => '交易不存在',
    '当前交易状态不允许支付' => '当前交易状态不允许支付',
    '只有买家才能支付' => '只有买家才能支付',
    '只有卖方才能进行延期操作' => '只有卖方才能进行延期操作',
    '当前状态不允许申请延期确认' => '当前状态不允许申请延期确认',
    '只有卖方才能进行确认' => '只有卖方才能进行确认',
    '当前状态交易不能确认' => '当前状态交易不能确认',
    '只有买方才有权限取消' => '只有买方才有权限取消',
    '当前状态交易不能取消' => '当前状态交易不能取消',
    '只有卖方才能发起维权' => '只有卖方才能发起维权',
    '配对交易' => '配对交易',
    '卖出确认交易' => '卖出确认交易',
    '状态不允许' => '状态不允许',
];
